Revit 2026 API

# FilterStringEndsWith Class

---

Tests whether string values from the document end with a certain string.

SystemObject Autodesk.Revit.DBFilterStringRuleEvaluator Autodesk.Revit.DBFilterStringEndsWith

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterStringEndsWith : FilterStringRuleEvaluator
```
```vb
Public Class FilterStringEndsWith
	Inherits FilterStringRuleEvaluator
```
```cpp
public ref class FilterStringEndsWith : public FilterStringRuleEvaluator
```
```fsharp
type FilterStringEndsWith =
    class
        inherit FilterStringRuleEvaluator
    end
```

The FilterStringEndsWith type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterStringEndsWith | Constructs an instance of FilterStringEndsWith. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterStringRuleEvaluator) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from FilterStringRuleEvaluator) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | Evaluate | Derived classes override this method to implement the test that determines whether the two given string values satisfy the desired condition or not. (Inherited from FilterStringRuleEvaluator) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

All string comparisons in this class are performed in the case-insensitive manner.

#### Reference

Autodesk.Revit.DB Namespace